# Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.
# Пользователь вводит 2 числа. n — кол-во элементов первого множества. m — кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.

n_set = set()
nCount = int(input('Введите кол-во элементов первого множества: '))
for i in range(nCount):
    n_set.add(input(f'Введите элемент под номером {i + 1}: '))
print(n_set)
m_set = set()
mCount = int(input('Введите кол-во элементов второго множества: '))
for i in range(mCount):
    m_set.add(input(f'Введите элемент {i + 1}: '))
print(m_set)
s_set = sorted(n_set.intersection(m_set))
print(*s_set)